'''
1. Выберете дз, к функциям которого будете писать тесты (например, вебинар 5);

2. Создайте дополнительную ветку в репозитории GitHub с тестами;

3. Напишите не менее 5ти тестов к функциям выбранного урока;

4. В качестве ответа на дз пришлите ссылку на ветку с тестами или ссылку на PullRequest ветки с тестами с веткой master.
'''

#==================================================================================
# Проверяем работоспособность функций из 5-го урока
import divisor_master
number = 113 # Нужно ввести любое просто число
#==================================================================================
# 1) Тест функции проверки числа на простоту

if divisor_master.simp_number(number):
    print("Test 1 is OK")
else:
    print("Test 1 is failed")


#==================================================================================
# 2) Тест функции вывод всех делителей числа
if divisor_master.divider_number(number)== [number,1]:
    print("Test 2 is OK")
else:
    print("Test 2 is failed")

#==================================================================================
# 3) Тест функции самый большой простой делитель числа.
if divisor_master.most_plain_divider (number) == number:
    print("Test 3 is OK")
else:
    print("Test 3 is failed")

#==================================================================================
# 4) Тест функции каноническое разложение числа на простые множители
if divisor_master.canon_decomposition_number (number) == [1,number]:
    print("Test 4 is OK")
else:
    print("Test 4 is failed")
#==================================================================================
# 5) Тест функции самый большой делитель числа (но не оно число).
if divisor_master.most_big_divider (number) == 1:
    print("Test 5 is OK")
else:
    print("Test 5 is failed")








